---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DetailCurve
source: html/df0aad15-f001-176d-dce4-197f0c19db50.htm
---
# DetailCurve Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.